{
  "en": {
    "login": {
      "title": "Are you Connected Engaged?",
      "helpMessage": "Rotate the images so they are the right way up before Logging in. Please Accept or Reject Cookies before logging in.",
      "loginButton": "Login",
      "noAccountText": "Don't have an account?",
      "registerLink": "Register here",
      "forgottenPasswordLink": "Forgotten password?",
      "usernamePlaceholder": "Username",
      "passwordPlaceholder": "Password",
      "cookieConsent": "Cookie Consent Options",
      "imageRotate": "Please rotate the images to the correct orientation before proceeding.",
      "consent": {
        "customize": "Customize",
        "acceptAll": "Accept All",
        "rejectAll": "Reject All",
        "info": "Information"
      },
      "modalTitle": "Cookie Information",
      "closeButton": "Close",
      "rejectAllMessage": "We have removed all cookies",
      "infoMessage": "We have two cookies which are for remembering your username and your language preference to remove the inconvenience of remembering your username or having to reselect your language preference the next time you login",
      "customizeMessage": "You can either accept the application specific cookies or reject them.",
      "passwordLengthError": "Password must be at least 8 characters",
      "cookieConsentError": "Please accept or reject cookies before logging in.",
      "imageOrientationError": "Please correctly orient the images before submitting.",
      "loginSuccess": "Login successful",
      "loginFailed": "Login failed",
      "loginFailedNetwork": "Login failed due to network error",
      "privacyPolicyLink": "Privacy Policy"
    },
    "privacyPolicy": {
      "title": "Privacy Policy",
      "introductionTitle": "Introduction",
      "introductionText": "We are committed to protecting your personal information and respecting your privacy. Our Privacy Policy outlines how we handle your data, including what information we collect, how we use it, and your rights regarding your personal information. We aim to ensure transparency and give you control over your data as you interact with our platform. By using our services, you agree to the collection and use of information in accordance with this policy. Please take a moment to review it carefully. This app is intended for users aged 18 and above.",
      "dataCollectionTitle": "Data We Collect",
      "dataCollectionText": "We collect your username, email address, password, profile picture, profile video, user preference data*, information about yourself and your ideal bot companion, location data (coordinates), preferred language, country of residence, registered IP address, and interaction history from the platform's FeedScreen. We do not share your data with third parties without your explicit consent.",
      "dataCollectionText2": "*User preference data: During the registration process, we collect preferences regarding hobbies, companionship traits, and compatibility preferences. This information is anonymized and used exclusively to tailor the platform experience and provide personalized recommendations or matches. This data does not explicitly identify sensitive personal information, such as sexual orientation or other protected characteristics.",
      "howWeUseDataTitle": "How We Use Your Data",
      "howWeUseDataText": "We use your data to provide our services and enhance your experience on the platform. This includes using your username and profile information to allow you to interact with other users, share content, and participate in the FeedScreen discussions. Your location data helps us to provide regionalized recommendations, while your preferences and profile details allow us to tailor matches and interactions to align with your interests. Additionally, we may use your email address to send important notifications and updates about your account or the platform. Your data is never shared with third parties, and we handle it securely in compliance with privacy regulations.",
      "dataRetentionTitle": "Data Retention",
      "dataRetentionText": "We retain your personal data only for as long as necessary to provide our services and comply with legal obligations. Once engagement ends, whether by user deletion or expiration, all associated media and text entries are stored in a zip file for archival purposes. This archived data is managed by our service provider and can be accessed if necessary for compliance, troubleshooting, or upon user request. If no need arises, the archived data will be securely deleted after a predefined period. You may request deletion of archived data at any time in accordance with your rights.",
      "rightsTitle": "Your Rights",
      "rightsText": "You have the right to access, modify, or delete your personal data at any time. This includes the right to download or request copies of your interactions and media stored in your engagement sessions. If you choose to delete your data, it will be removed from the system in accordance with our data retention policy. Additionally, you may request the removal of archived data before its scheduled deletion. You also have the right to limit certain data collection if you prefer, which may affect some features of the app.",
      "consentTitle": "Consent",
      "consentText": "By using this app, you consent to our privacy policy and agree to the collection, storage, and use of your personal information as described. You acknowledge that your data may be archived after engagement expiration for compliance or future reference, and you accept the terms of this process. If at any point you wish to withdraw your consent or alter the use of your data, you can exercise your rights as outlined above. Explicit consent will be required before collecting sensitive data such as location or user preferences.",
      "contactInfo": "For any questions, contact us at connectedengaged@gmail.com.",
      "backToBase": "Back to Base"
    }
  },
  "es": {
    "login": {
      "title": "¿Estás Conectado Comprometido?",
      "helpMessage": "Gira las imágenes para que estén del lado correcto antes de iniciar sesión. Acepte o rechace las cookies antes de iniciar sesión.",
      "loginButton": "Iniciar sesión",
      "noAccountText": "¿No tienes una cuenta?",
      "registerLink": "Regístrate aquí",
      "forgottenPasswordLink": "¿Olvidaste tu contraseña?",
      "usernamePlaceholder": "Nombre de usuario",
      "passwordPlaceholder": "Contraseña",
      "cookieConsent": "Opciones de Consentimiento de Cookies",
      "imageRotate": "Por favor, gire las imágenes a la orientación correcta antes de continuar.",
      "consent": {
        "customize": "Personalizar",
        "acceptAll": "Aceptar todo",
        "rejectAll": "Rechazar todo",
        "info": "Información"
      },
      "modalTitle": "Información de cookies",
      "closeButton": "Cerrar",
      "rejectAllMessage": "Hemos eliminado todas las cookies",
      "infoMessage": "Tenemos dos cookies para recordar tu nombre de usuario y tu preferencia de idioma para evitar la molestia de tener que recordar tu nombre de usuario o volver a seleccionar tu preferencia de idioma la próxima vez que inicies sesión",
      "customizeMessage": "Puedes aceptar las cookies específicas de la aplicación o rechazarlas.",
      "passwordLengthError": "La contraseña debe tener al menos 8 caracteres",
      "cookieConsentError": "Por favor, acepte o rechace las cookies antes de iniciar sesión.",
      "imageOrientationError": "Por favor, oriente correctamente las imágenes antes de enviar.",
      "loginSuccess": "Inicio de sesión exitoso",
      "loginFailed": "Inicio de sesión fallido",
      "loginFailedNetwork": "Error de inicio de sesión debido a un error de red",
      "privacyPolicyLink": "Política de Privacidad"
    },
    "privacyPolicy": {
      "title": "Política de Privacidad",
      "introductionTitle": "Introducción",
      "introductionText": "Estamos comprometidos a proteger su información personal y respetar su privacidad. Nuestra Política de Privacidad detalla cómo manejamos sus datos, incluyendo qué información recopilamos, cómo la usamos y sus derechos con respecto a su información personal. Nuestro objetivo es garantizar la transparencia y brindarle control sobre sus datos mientras interactúa con nuestra plataforma. Al usar nuestros servicios, usted acepta la recopilación y el uso de información de acuerdo con esta política. Por favor, tómese un momento para revisarla cuidadosamente. Esta aplicación está destinada a usuarios mayores de 18 años.",
      "dataCollectionTitle": "Datos Que Recopilamos",
      "dataCollectionText": "Recopilamos su nombre de usuario, dirección de correo electrónico, contraseña, foto de perfil, video de perfil, datos de preferencias del usuario*, información sobre usted y su bot ideal, datos de ubicación (coordenadas), idioma preferido, país de residencia, dirección IP registrada e historial de interacciones de la FeedScreen de la plataforma. No compartimos sus datos con terceros sin su consentimiento explícito.",
      "dataCollectionText2": "*Datos de preferencias del usuario: Durante el proceso de registro, recopilamos preferencias relacionadas con pasatiempos, características de compañía ideales y preferencias de compatibilidad. Esta información es anonimizada y se utiliza exclusivamente para personalizar la experiencia en la plataforma y proporcionar recomendaciones o coincidencias personalizadas. Estos datos no identifican explícitamente información sensible, como orientación sexual u otras características protegidas.",
      "howWeUseDataTitle": "Cómo Usamos Sus Datos",
      "howWeUseDataText": "Usamos sus datos para proporcionar nuestros servicios y mejorar su experiencia en la plataforma. Esto incluye usar su nombre de usuario e información de perfil para permitirle interactuar con otros usuarios, compartir contenido y participar en discusiones en FeedScreen. Sus datos de ubicación nos ayudan a proporcionar recomendaciones regionales, mientras que sus preferencias y detalles de perfil nos permiten adaptar coincidencias e interacciones que se alineen con sus intereses. Además, podemos usar su dirección de correo electrónico para enviarle notificaciones importantes y actualizaciones sobre su cuenta o la plataforma. Sus datos nunca se comparten con terceros, y los manejamos de manera segura cumpliendo con las regulaciones de privacidad.",
      "dataRetentionTitle": "Retención de Datos",
      "dataRetentionText": "Conservamos sus datos personales solo durante el tiempo necesario para proporcionar nuestros servicios y cumplir con obligaciones legales. Una vez que finalice la interacción, ya sea por eliminación por parte del usuario o por expiración, todos los medios y textos asociados se almacenan en un archivo comprimido con fines de archivo. Este archivo es administrado por nuestro proveedor de servicios y puede ser accedido si es necesario para cumplimiento, resolución de problemas o a solicitud del usuario. Si no surge ninguna necesidad, los datos archivados serán eliminados de forma segura después de un período predefinido. Puede solicitar la eliminación de los datos archivados en cualquier momento de acuerdo con sus derechos.",
      "rightsTitle": "Sus Derechos",
      "rightsText": "Tiene derecho a acceder, modificar o eliminar sus datos personales en cualquier momento. Esto incluye el derecho a descargar o solicitar copias de sus interacciones y medios almacenados en sus sesiones de interacción. Si elige eliminar sus datos, se eliminarán del sistema de acuerdo con nuestra política de retención de datos. Además, puede solicitar la eliminación de datos archivados antes de su eliminación programada. También tiene derecho a limitar la recopilación de ciertos datos si lo prefiere, lo que puede afectar algunas características de la aplicación.",
      "consentTitle": "Consentimiento",
      "consentText": "Al usar esta aplicación, usted acepta nuestra política de privacidad y está de acuerdo con la recopilación, almacenamiento y uso de su información personal según lo descrito. Usted reconoce que sus datos pueden archivarse después de la expiración de la interacción para fines de cumplimiento o referencia futura, y acepta los términos de este proceso. Si en algún momento desea retirar su consentimiento o modificar el uso de sus datos, puede ejercer sus derechos como se describe anteriormente. Se requerirá un consentimiento explícito antes de recopilar datos sensibles, como ubicación o preferencias del usuario.",
      "contactInfo": "Si tiene alguna pregunta, contáctenos en connectedengaged@gmail.com.",
      "backToBase": "Volver al Inicio"
    }
  },
  "fr": {
    "login": {
      "title": "Êtes-vous Connecté Engagé?",
      "helpMessage": "Faites pivoter les images pour qu'elles soient dans le bon sens avant de vous connecter. Veuillez accepter ou rejeter les cookies avant de vous connecter.",
      "loginButton": "Connexion",
      "noAccountText": "Vous n'avez pas de compte?",
      "registerLink": "Inscrivez-vous ici",
      "forgottenPasswordLink": "Mot de passe oublié?",
      "usernamePlaceholder": "Nom d'utilisateur",
      "passwordPlaceholder": "Mot de passe",
      "cookieConsent": "Options de Consentement aux Cookies",
      "imageRotate": "Veuillez orienter les images correctement avant de continuer.",
      "consent": {
        "customize": "Personnaliser",
        "acceptAll": "Tout accepter",
        "rejectAll": "Tout rejeter",
        "info": "Information"
      },
      "modalTitle": "Informations sur les cookies",
      "closeButton": "Fermer",
      "rejectAllMessage": "Nous avons supprimé tous les cookies",
      "infoMessage": "Nous avons deux cookies pour mémoriser votre nom d'utilisateur et votre préférence de langue afin d'éviter la gêne de devoir mémoriser votre nom d'utilisateur ou de devoir à nouveau sélectionner votre préférence de langue la prochaine fois que vous vous connectez",
      "customizeMessage": "Vous pouvez accepter les cookies spécifiques à l'application ou les rejeter.",
      "passwordLengthError": "Le mot de passe doit comporter au moins 8 caractères",
      "cookieConsentError": "Veuillez accepter ou refuser les cookies avant de vous connecter.",
      "imageOrientationError": "Veuillez orienter correctement les images avant de soumettre.",
      "loginSuccess": "Connexion réussie",
      "loginFailed": "Échec de la connexion",
      "loginFailedNetwork": "Échec de la connexion en raison d'une erreur réseau",
      "privacyPolicyLink": "Politique de Confidentialité"
    },
    "privacyPolicy": {
      "title": "Politique de Confidentialité",
      "introductionTitle": "Introduction",
      "introductionText": "Nous nous engageons à protéger vos informations personnelles et à respecter votre vie privée. Notre Politique de Confidentialité explique comment nous traitons vos données, y compris quelles informations nous collectons, comment nous les utilisons et vos droits concernant vos informations personnelles. Nous visons à garantir la transparence et à vous donner le contrôle de vos données lorsque vous interagissez avec notre plateforme. En utilisant nos services, vous acceptez la collecte et l'utilisation des informations conformément à cette politique. Veuillez prendre un moment pour l'examiner attentivement. Cette application est destinée aux utilisateurs âgés de 18 ans et plus.",
      "dataCollectionTitle": "Données que Nous Collectons",
      "dataCollectionText": "Nous collectons votre nom d'utilisateur, adresse e-mail, mot de passe, photo de profil, vidéo de profil, données de préférences utilisateur*, informations sur vous et votre bot compagnon idéal, données de localisation (coordonnées), langue préférée, pays de résidence, adresse IP enregistrée et historique des interactions dans le FeedScreen de la plateforme. Nous ne partageons pas vos données avec des tiers sans votre consentement explicite.",
      "dataCollectionText2": "*Données de préférences utilisateur : Lors du processus d'inscription, nous collectons des préférences liées à vos hobbies, aux caractéristiques idéales de compagnie et aux préférences de compatibilité. Ces informations sont anonymisées et utilisées uniquement pour personnaliser votre expérience sur la plateforme et fournir des recommandations ou des correspondances adaptées. Ces données ne permettent pas d'identifier explicitement des informations sensibles telles que l'orientation sexuelle ou d'autres caractéristiques protégées.",
      "howWeUseDataTitle": "Comment Nous Utilisons Vos Données",
      "howWeUseDataText": "Nous utilisons vos données pour fournir nos services et améliorer votre expérience sur la plateforme. Cela inclut l'utilisation de votre nom d'utilisateur et des informations de profil pour vous permettre d'interagir avec d'autres utilisateurs, de partager du contenu et de participer aux discussions sur le FeedScreen. Vos données de localisation nous aident à fournir des recommandations locales, tandis que vos préférences et détails de profil nous permettent d'adapter les correspondances et interactions à vos intérêts. De plus, nous pouvons utiliser votre adresse e-mail pour vous envoyer des notifications importantes et des mises à jour concernant votre compte ou la plateforme. Vos données ne sont jamais partagées avec des tiers, et nous les gérons de manière sécurisée en conformité avec les réglementations en matière de confidentialité.",
      "dataRetentionTitle": "Conservation des Données",
      "dataRetentionText": "Nous conservons vos données personnelles uniquement aussi longtemps que nécessaire pour fournir nos services et respecter nos obligations légales. Une fois l'engagement terminé, soit par suppression par l'utilisateur, soit par expiration, tous les médias et textes associés sont stockés dans un fichier compressé à des fins d'archivage. Ce fichier est géré par notre fournisseur de services et peut être consulté si nécessaire pour des raisons de conformité, de résolution de problèmes ou sur demande de l'utilisateur. Si aucun besoin ne survient, les données archivées seront supprimées de manière sécurisée après une période prédéfinie. Vous pouvez demander la suppression des données archivées à tout moment conformément à vos droits.",
      "rightsTitle": "Vos Droits",
      "rightsText": "Vous avez le droit d'accéder, de modifier ou de supprimer vos données personnelles à tout moment. Cela inclut le droit de télécharger ou de demander des copies de vos interactions et des médias stockés dans vos sessions d'engagement. Si vous choisissez de supprimer vos données, elles seront supprimées du système conformément à notre politique de conservation des données. En outre, vous pouvez demander la suppression des données archivées avant leur suppression programmée. Vous avez également le droit de limiter la collecte de certaines données si vous le souhaitez, ce qui peut affecter certaines fonctionnalités de l'application.",
      "consentTitle": "Consentement",
      "consentText": "En utilisant cette application, vous acceptez notre politique de confidentialité et consentez à la collecte, au stockage et à l'utilisation de vos informations personnelles telles que décrites. Vous reconnaissez que vos données peuvent être archivées après l'expiration de l'engagement à des fins de conformité ou de référence future, et vous acceptez les termes de ce processus. Si, à tout moment, vous souhaitez retirer votre consentement ou modifier l'utilisation de vos données, vous pouvez exercer vos droits comme indiqué ci-dessus. Un consentement explicite sera requis avant de collecter des données sensibles, telles que la localisation ou les préférences utilisateur.",
      "contactInfo": "Pour toute question, contactez-nous à connectedengaged@gmail.com.",
      "backToBase": "Retour à l'Accueil"
    }
  },
  "de": {
    "login": {
      "title": "Bist du Verbunden Engagiert?",
      "helpMessage": "Drehen Sie die Bilder, damit sie richtig sind, bevor Sie sich einloggen. Bitte akzeptieren oder lehnen Sie Cookies ab, bevor Sie sich einloggen.",
      "loginButton": "Anmelden",
      "noAccountText": "Haben Sie kein Konto?",
      "registerLink": "Hier registrieren",
      "forgottenPasswordLink": "Passwort vergessen?",
      "usernamePlaceholder": "Benutzername",
      "passwordPlaceholder": "Passwort",
      "cookieConsent": "Cookie-Einwilligungsoptionen",
      "imageRotate": "Bitte drehen Sie die Bilder in die richtige Ausrichtung, bevor Sie fortfahren.",
      "consent": {
        "customize": "Anpassen",
        "acceptAll": "Alles akzeptieren",
        "rejectAll": "Alles ablehnen",
        "info": "Information"
      },
      "modalTitle": "Cookie-Informationen",
      "closeButton": "Schließen",
      "rejectAllMessage": "Wir haben alle Cookies entfernt",
      "infoMessage": "Wir haben zwei Cookies, die dazu dienen, Ihren Benutzernamen und Ihre Sprachpräferenz zu speichern, um die Unannehmlichkeit zu vermeiden, sich an Ihren Benutzernamen erinnern oder Ihre Sprachpräferenz beim nächsten Login erneut auswählen zu müssen",
      "customizeMessage": "Sie können die anwendungsspezifischen Cookies entweder akzeptieren oder ablehnen.",
      "passwordLengthError": "Das Passwort muss mindestens 8 Zeichen lang sein",
      "cookieConsentError": "Bitte akzeptieren oder lehnen Sie Cookies ab, bevor Sie sich einloggen.",
      "imageOrientationError": "Bitte richten Sie die Bilder korrekt aus, bevor Sie sie einreichen.",
      "loginSuccess": "Anmeldung erfolgreich",
      "loginFailed": "Anmeldung fehlgeschlagen",
      "loginFailedNetwork": "Anmeldung aufgrund eines Netzwerkfehlers fehlgeschlagen",
      "privacyPolicyLink": "Datenschutzerklärung"
    },
    "privacyPolicy": {
      "title": "Datenschutzrichtlinie",
      "introductionTitle": "Einleitung",
      "introductionText": "Wir verpflichten uns, Ihre persönlichen Daten zu schützen und Ihre Privatsphäre zu respektieren. Unsere Datenschutzrichtlinie beschreibt, wie wir Ihre Daten verarbeiten, welche Informationen wir sammeln, wie wir sie nutzen und welche Rechte Sie in Bezug auf Ihre persönlichen Daten haben. Wir legen großen Wert auf Transparenz und möchten Ihnen die Kontrolle über Ihre Daten ermöglichen, während Sie unsere Plattform nutzen. Durch die Nutzung unserer Dienste stimmen Sie der Erfassung und Nutzung von Informationen gemäß dieser Richtlinie zu. Bitte nehmen Sie sich einen Moment Zeit, um die Richtlinie sorgfältig zu lesen. Diese App ist für Nutzer ab 18 Jahren bestimmt.",
      "dataCollectionTitle": "Welche Daten wir sammeln",
      "dataCollectionText": "Wir sammeln Ihren Benutzernamen, Ihre E-Mail-Adresse, Ihr Passwort, Ihr Profilbild, Ihr Profilvideo, Nutzervorlieben*, Informationen über Sie und Ihren idealen Bot-Gefährten, Standortdaten (Koordinaten), bevorzugte Sprache, Wohnsitzland, die registrierte IP-Adresse und Interaktionsdaten aus der FeedScreen der Plattform. Wir geben Ihre Daten ohne Ihre ausdrückliche Zustimmung nicht an Dritte weiter.",
      "dataCollectionText2": "*Nutzervorlieben: Während des Registrierungsprozesses sammeln wir Daten zu Ihren Vorlieben, einschließlich, aber nicht beschränkt auf Hobbys, bevorzugte Eigenschaften von Gefährten und visuelle Auswahl. Diese Informationen werden verwendet, um Ihre Erfahrung auf der Plattform zu personalisieren und können für Empfehlungen oder Übereinstimmungen genutzt werden. Sie können die Erfassung bestimmter Vorlieben während der Registrierung einschränken.",
      "howWeUseDataTitle": "Wie wir Ihre Daten verwenden",
      "howWeUseDataText": "Wir verwenden Ihre Daten, um unsere Dienste bereitzustellen und Ihre Erfahrung auf der Plattform zu verbessern. Dazu gehört die Nutzung Ihres Benutzernamens und Ihrer Profilinformationen, um Ihnen die Interaktion mit anderen Nutzern, das Teilen von Inhalten und die Teilnahme an Diskussionen im FeedScreen zu ermöglichen. Ihre Standortdaten helfen uns, lokalisierten Inhalt bereitzustellen, während Ihre Vorlieben und Profildetails uns ermöglichen, Empfehlungen, Übereinstimmungen und Interaktionen auf Ihre Interessen abzustimmen. Zusätzlich können wir Ihre E-Mail-Adresse verwenden, um Ihnen wichtige Benachrichtigungen und Updates zu Ihrem Konto sowie relevante Plattforminformationen zu senden. Ihre Daten werden nicht an Dritte weitergegeben, und wir sorgen dafür, dass sie sicher und im Einklang mit den Datenschutzbestimmungen behandelt werden.",
      "dataRetentionTitle": "Datenaufbewahrung",
      "dataRetentionText": "Wir bewahren Ihre persönlichen Daten nur so lange auf, wie es notwendig ist, um unsere Dienste bereitzustellen und gesetzliche Verpflichtungen zu erfüllen. Nach Beendigung der Nutzung, entweder durch Benutzerlöschung oder Ablauf, werden alle zugehörigen Medien und Texte in einer komprimierten Datei zu Archivierungszwecken gespeichert. Diese Datei wird von unserem Dienstleister verwaltet und kann bei Bedarf für Compliance-, Fehlerbehebungs- oder Benutzeranfragen eingesehen werden. Falls keine Notwendigkeit besteht, werden die archivierten Daten nach einer festgelegten Frist sicher gelöscht. Sie können jederzeit die Löschung archivierter Daten beantragen, gemäß Ihren Rechten.",
      "rightsTitle": "Ihre Rechte",
      "rightsText": "Sie haben das Recht, jederzeit auf Ihre persönlichen Daten zuzugreifen, sie zu ändern oder zu löschen. Dazu gehört das Recht, Kopien Ihrer Interaktionen und Medien, die in Ihren Engagement-Sitzungen gespeichert sind, herunterzuladen oder anzufordern. Wenn Sie Ihre Daten löschen möchten, werden sie gemäß unserer Datenschutzrichtlinie aus dem System entfernt. Zusätzlich können Sie die Entfernung archivierter Daten vor deren geplanten Löschung beantragen. Sie haben auch das Recht, die Erfassung bestimmter Daten einzuschränken, was jedoch einige Funktionen der App beeinträchtigen kann.",
      "consentTitle": "Einwilligung",
      "consentText": "Durch die Nutzung dieser App stimmen Sie unserer Datenschutzrichtlinie zu und erklären sich mit der Erfassung, Speicherung und Nutzung Ihrer persönlichen Informationen einverstanden, wie hierin beschrieben. Sie erkennen an, dass Ihre Daten nach Ablauf der Nutzung zu Compliance-Zwecken oder als Referenz archiviert werden können, und akzeptieren die Bedingungen dieses Prozesses. Wenn Sie Ihre Einwilligung zu irgendeinem Zeitpunkt widerrufen oder die Nutzung Ihrer Daten ändern möchten, können Sie Ihre oben beschriebenen Rechte ausüben. Vor der Erfassung sensibler Daten wie Standort oder Nutzervorlieben wird Ihre ausdrückliche Zustimmung eingeholt.",
      "contactInfo": "Für Fragen kontaktieren Sie uns bitte unter connectedengaged@gmail.com.",
      "backToBase": "Zurück zur Startseite"
    }
  },
  "ar": {
    "login": {
      "title": "هل أنت متصل وملتزم؟",
      "helpMessage": "قم بتدوير الصور بحيث تكون في الاتجاه الصحيح قبل تسجيل الدخول. الرجاء قبول أو رفض ملفات تعريف الارتباط قبل تسجيل الدخول.",
      "loginButton": "تسجيل الدخول",
      "noAccountText": "ليس لديك حساب؟",
      "registerLink": "سجل هنا",
      "forgottenPasswordLink": "نسيت كلمة المرور؟",
      "usernamePlaceholder": "اسم المستخدم",
      "passwordPlaceholder": "كلمة المرور",
      "cookieConsent": "خيارات موافقة ملفات تعريف الارتباط",
      "imageRotate": "يرجى تدوير الصور إلى الاتجاه الصحيح قبل المتابعة.",
      "consent": {
        "customize": "تخصيص",
        "acceptAll": "قبول الكل",
        "rejectAll": "رفض الكل",
        "info": "معلومات"
      },
      "modalTitle": "معلومات ملفات تعريف الارتباط",
      "closeButton": "إغلاق",
      "rejectAllMessage": "لقد أزلنا جميع ملفات تعريف الارتباط",
      "infoMessage": "لدينا ملفا تعريف ارتباط لتذكر اسم المستخدم وتفضيل اللغة الخاص بك لتجنب متاعب تذكر اسم المستخدم الخاص بك أو الحاجة إلى إعادة تحديد تفضيل اللغة الخاص بك في المرة التالية التي تقوم فيها بتسجيل الدخول",
      "customizeMessage": "يمكنك إما قبول ملفات تعريف الارتباط الخاصة بالتطبيق أو رفضها.",
      "passwordLengthError": "يجب أن تكون كلمة المرور مكونة من 8 أحرف على الأقل",
      "cookieConsentError": "يرجى قبول أو رفض ملفات تعريف الارتباط قبل تسجيل الدخول.",
      "imageOrientationError": "يرجى توجيه الصور بشكل صحيح قبل الإرسال.",
      "loginSuccess": "تم تسجيل الدخول بنجاح",
      "loginFailed": "فشل تسجيل الدخول",
      "loginFailedNetwork": "فشل تسجيل الدخول بسبب خطأ في الشبكة",
      "privacyPolicyLink": "سياسة الخصوصية"
    },
    "privacyPolicy": {
      "title": "سياسة الخصوصية",
      "introductionTitle": "المقدمة",
      "introductionText": "نلتزم بحماية معلوماتك الشخصية واحترام خصوصيتك. توضح سياسة الخصوصية الخاصة بنا كيفية تعاملنا مع بياناتك، بما في ذلك المعلومات التي نجمعها، وكيف نستخدمها، وحقوقك المتعلقة بمعلوماتك الشخصية. نسعى لضمان الشفافية ومنحك التحكم الكامل ببياناتك أثناء استخدامك لمنصتنا. باستخدام خدماتنا، فإنك توافق على جمع واستخدام المعلومات وفقًا لهذه السياسة. يرجى تخصيص وقت لمراجعتها بعناية. هذه المنصة مخصصة للمستخدمين الذين يبلغون 18 عامًا فأكثر.",
      "dataCollectionTitle": "البيانات التي نجمعها",
      "dataCollectionText": "نجمع اسم المستخدم، وعنوان البريد الإلكتروني، وكلمة المرور، وصورة الملف الشخصي، وفيديو الملف الشخصي، وبيانات تفضيلات المستخدم*، ومعلومات عنك وعن شريك الروبوت المثالي، وبيانات الموقع (الإحداثيات)، واللغة المفضلة، وبلد الإقامة، وعنوان IP المسجل، وسجل التفاعلات من شاشة التغذية في المنصة. لا نشارك بياناتك مع أطراف ثالثة دون موافقتك الصريحة.",
      "dataCollectionText2": "*بيانات تفضيلات المستخدم: أثناء عملية التسجيل، نجمع بيانات تتعلق بتفضيلاتك، بما في ذلك على سبيل المثال لا الحصر الهوايات، وسمات الشراكة المثالية، والاختيارات المرئية. تُستخدم هذه المعلومات لتخصيص تجربتك على المنصة وقد تُستخدم في المطابقة أو التوصيات. يمكنك اختيار تقييد جمع بعض التفضيلات أثناء التسجيل.",
      "howWeUseDataTitle": "كيف نستخدم بياناتك",
      "howWeUseDataText": "نستخدم بياناتك لتقديم خدماتنا وتحسين تجربتك على المنصة. يتضمن ذلك استخدام اسم المستخدم ومعلومات الملف الشخصي للسماح لك بالتفاعل مع المستخدمين الآخرين، ومشاركة المحتوى، والمشاركة في المناقشات على شاشة التغذية. تساعدنا بيانات موقعك في تقديم محتوى محلي، بينما تمكننا تفضيلاتك وتفاصيل ملفك الشخصي من تخصيص التوصيات والمطابقات والتفاعلات لتتناسب مع اهتماماتك وتفضيلاتك. كما يمكننا استخدام عنوان بريدك الإلكتروني لإرسال إشعارات وتحديثات مهمة تتعلق بحسابك بالإضافة إلى معلومات متعلقة بالمنصة. لا تتم مشاركة بياناتك مع أطراف ثالثة، ونضمن التعامل معها بأمان ووفقًا للوائح الخصوصية.",
      "dataRetentionTitle": "الاحتفاظ بالبيانات",
      "dataRetentionText": "نحتفظ ببياناتك الشخصية فقط طالما كان ذلك ضروريًا لتقديم خدماتنا والامتثال للالتزامات القانونية. بعد انتهاء الاستخدام، سواء بحذف المستخدم أو انتهاء الفترة، يتم تخزين جميع الوسائط والنصوص ذات الصلة في ملف مضغوط لأغراض الأرشفة. تتم إدارة هذا الملف من قبل مزود الخدمة الخاص بنا ويمكن الوصول إليه عند الضرورة للامتثال أو حل المشكلات أو بناءً على طلب المستخدم. إذا لم تنشأ حاجة لذلك، فسيتم حذف البيانات المؤرشفة بأمان بعد فترة محددة. يمكنك طلب حذف البيانات المؤرشفة في أي وقت وفقًا لحقوقك.",
      "rightsTitle": "حقوقك",
      "rightsText": "لديك الحق في الوصول إلى بياناتك الشخصية أو تعديلها أو حذفها في أي وقت. يشمل ذلك الحق في تنزيل أو طلب نسخ من تفاعلاتك والوسائط المخزنة في جلساتك على المنصة. إذا اخترت حذف بياناتك، فسيتم إزالتها من النظام وفقًا لسياسة الاحتفاظ بالبيانات الخاصة بنا. بالإضافة إلى ذلك، يمكنك طلب إزالة البيانات المؤرشفة قبل تاريخ حذفها المقرر. لديك أيضًا الحق في تقييد جمع بعض البيانات إذا كنت تفضل ذلك، مما قد يؤثر على بعض ميزات التطبيق.",
      "consentTitle": "الموافقة",
      "consentText": "باستخدام هذا التطبيق، فإنك توافق على سياسة الخصوصية الخاصة بنا وتوافق على جمع معلوماتك الشخصية وتخزينها واستخدامها كما هو موضح هنا. تقر بأنه قد يتم أرشفة بياناتك بعد انتهاء الاستخدام لأغراض الامتثال أو كمرجع مستقبلي، وتقبل شروط هذه العملية. إذا كنت ترغب في سحب موافقتك أو تعديل استخدام بياناتك في أي وقت، يمكنك ممارسة حقوقك الموضحة أعلاه. ستُطلب موافقتك الصريحة قبل جمع البيانات الحساسة مثل الموقع أو تفضيلات المستخدم.",
      "contactInfo": "لأي استفسارات، يرجى التواصل معنا عبر connectedengaged@gmail.com.",
      "backToBase": "العودة إلى الصفحة الرئيسية"
    }
  },
  "zh": {
    "login": {
      "title": "你已连接并参与吗？",
      "helpMessage": "在登录之前，请将图像旋转到正确的位置。请在登录前接受或拒绝cookie。",
      "loginButton": "登录",
      "noAccountText": "没有账号？",
      "registerLink": "在这里注册",
      "forgottenPasswordLink": "忘记密码？",
      "usernamePlaceholder": "用户名",
      "passwordPlaceholder": "密码",
      "cookieConsent": "Cookie 同意选项",
      "imageRotate": "请将图像旋转到正确的方向后再继续。",
      "consent": {
        "customize": "自定义",
        "acceptAll": "全部接受",
        "rejectAll": "全部拒绝",
        "info": "信息"
      },
      "modalTitle": "Cookie信息",
      "closeButton": "关闭",
      "rejectAllMessage": "我们已删除所有cookie",
      "infoMessage": "我们有两个cookie，用于记住您的用户名和语言偏好，以避免下次登录时必须记住用户名或重新选择语言偏好的麻烦",
      "customizeMessage": "您可以接受应用程序特定的cookie或拒绝它们。",
      "passwordLengthError": "密码至少需要 8 个字符",
      "cookieConsentError": "请在登录前接受或拒绝 Cookie。",
      "imageOrientationError": "请在提交前正确调整图像的方向。",
      "loginSuccess": "登录成功",
      "loginFailed": "登录失败",
      "loginFailedNetwork": "由于网络错误，登录失败",
      "privacyPolicyLink": "隐私政策"
    },
    "privacyPolicy": {
      "title": "隐私政策",
      "introductionTitle": "简介",
      "introductionText": "我们致力于保护您的个人信息并尊重您的隐私。我们的隐私政策概述了我们如何处理您的数据，包括我们收集的信息、我们如何使用这些信息以及您对您个人信息的权利。我们致力于确保透明度，并在您与我们平台互动时为您提供对数据的控制权。通过使用我们的服务，您同意根据本政策收集和使用信息。请花些时间仔细阅读。本应用适用于年满18岁的用户。",
      "dataCollectionTitle": "我们收集的数据",
      "dataCollectionText": "我们收集您的用户名、电子邮件地址、密码、个人资料图片、个人资料视频、用户偏好数据*、关于您和您理想机器人伴侣的信息、位置信息（坐标）、首选语言、居住国家、注册的IP地址，以及平台FeedScreen的互动历史。未经您的明确同意，我们不会与第三方共享您的数据。",
      "dataCollectionText2": "*用户偏好数据：在注册过程中，我们会收集与您的偏好相关的数据，包括但不限于兴趣爱好、理想的伴侣特征和视觉选择。这些信息用于个性化您的平台体验，并可能用于匹配或推荐目的。您可以选择在注册过程中限制某些偏好的收集。",
      "howWeUseDataTitle": "我们如何使用您的数据",
      "howWeUseDataText": "我们使用您的数据来提供我们的服务并增强您在平台上的体验。这包括使用您的用户名和个人资料信息，让您可以与其他用户互动、共享内容并参与FeedScreen讨论。您的位置信息有助于我们提供本地化内容，而您的偏好和个人资料详细信息让我们能够根据您的兴趣和偏好定制推荐、匹配和互动。我们还可以使用您的电子邮件地址向您发送与您的账户相关的重要通知和更新，以及平台的相关信息。您的数据不会与第三方共享，我们确保它受到安全处理，并符合隐私法规。",
      "dataRetentionTitle": "数据保留",
      "dataRetentionText": "我们仅在提供服务和履行法律义务所需的时间内保留您的个人数据。在使用结束后，无论是用户删除账户还是到期，所有相关的媒体和文本条目都会存储在一个归档文件中。该归档文件由我们的服务提供商管理，并在需要时用于合规、故障排除或根据用户请求进行访问。如果没有出现需求，归档数据将在规定的时间后安全删除。您可以随时根据您的权利请求删除归档数据。",
      "rightsTitle": "您的权利",
      "rightsText": "您有权随时访问、修改或删除您的个人数据。这包括下载或请求存储在您的互动会话中的互动和媒体副本的权利。如果您选择删除您的数据，它将根据我们的数据保留政策从系统中移除。此外，您可以在其预定删除日期之前请求删除归档数据。您还可以选择限制某些数据的收集，这可能会影响应用的某些功能。",
      "consentTitle": "同意",
      "consentText": "通过使用本应用，您同意我们的隐私政策，并同意按所述方式收集、存储和使用您的个人信息。您承认在使用结束后，您的数据可能会被归档以用于合规或未来参考，并接受此过程的条款。如果您希望撤回同意或更改数据使用方式，您可以行使上述权利。在收集敏感数据（例如位置或用户偏好）之前，我们会征得您的明确同意。",
      "contactInfo": "如有任何疑问，请通过connectedengaged@gmail.com与我们联系。",
      "backToBase": "返回主页"
    }
  },
  "ga": {
    "login": {
      "title": "An bhfuil tú Ceangailte agus Rannpháirteach?",
      "helpMessage": "Rothlaigh na híomhánna chun iad a bheith dírithe i gceart sula logálann tú isteach. Glac nó diúltaigh fianáin sula logálann tú isteach.",
      "loginButton": "Logáil Isteach",
      "noAccountText": "Níl cuntas agat?",
      "registerLink": "Cláraigh anseo",
      "forgottenPasswordLink": "Pasfhocal dearmadta?",
      "usernamePlaceholder": "Ainm úsáideora",
      "passwordPlaceholder": "Focal faire",
      "cookieConsent": "Roghanna Toilithe Fianán",
      "imageRotate": "Roghnaigh na híomhánna sa treoshuíomh ceart sula leanfaidh tú ar aghaidh.",
      "consent": {
        "customize": "Saincheap",
        "acceptAll": "Glac le Gach Rud",
        "rejectAll": "Diúltaigh do Gach Rud",
        "info": "Eolas"
      },
      "modalTitle": "Eolas Fianáin",
      "closeButton": "Dún",
      "rejectAllMessage": "Tá gach fianán bainte againn",
      "infoMessage": "Tá dhá fhianán againn le haghaidh do ainm úsáideora agus do rogha teanga a mheabhrú, ionas nach mbeidh ort cuimhneamh ar do ainm úsáideora nó an rogha teanga a athrú an chéad uair eile a logálann tú isteach.",
      "customizeMessage": "Is féidir leat glacadh le fianáin sonracha don fheidhmchlár nó diúltú dóibh.",
      "passwordLengthError": "Caithfidh an pasfhocal a bheith ar a laghad 8 gcarachtar",
      "cookieConsentError": "Glac nó diúltaigh fianáin sula logálann tú isteach.",
      "imageOrientationError": "Déan cinnte go bhfuil na híomhánna dírithe i gceart sula gcuireann tú isteach iad.",
      "loginSuccess": "Logáil isteach rathúil",
      "loginFailed": "Theip ar logáil isteach",
      "loginFailedNetwork": "Theip ar logáil isteach de bharr earráid líonra",
      "privacyPolicyLink": "Polasaí Príobháideachais"
    },
    "privacyPolicy": {
      "title": "Polasaí Príobháideachais",
      "introductionTitle": "Réamhrá",
      "introductionText": "Táimid tiomanta do do chuid faisnéise pearsanta a chosaint agus do phríobháideacht a urramú. Déanann ár bPolasaí Príobháideachais cur síos ar conas a dhéileálfaimid le do chuid sonraí, lena n-áirítear an fhaisnéis a bhailímid, conas a úsáidimid í, agus do chearta maidir le do chuid faisnéise pearsanta. Táimid ag iarraidh trédhearcacht a chinntiú agus smacht a thabhairt duit ar do chuid sonraí agus tú ag úsáid ár n-ardán. Trí úsáid a bhaint as ár seirbhísí, aontaíonn tú leis an mbailiúchán agus leis an úsáid faisnéise mar atá leagtha amach sa bpolasaí seo. Tóg nóiméad chun é a athbhreithniú go cúramach. Tá an aip seo beartaithe do dhaoine atá 18 mbliana d’aois nó níos sine.",
      "dataCollectionTitle": "Sonraí a Bhailímid",
      "dataCollectionText": "Bailímid d’ainm úsáideora, do sheoladh ríomhphoist, do phasfhocal, do phictiúr próifíle, do fhíseán próifíle, sonraí faoi do roghanna úsáideora*, faisnéis fút féin agus faoi do chomrádaí idéalach bot, sonraí suímh (comhordanáidí), an teanga is fearr leat, an tír ina bhfuil tú, do sheoladh IP cláraithe, agus stair idirghníomhaíochta ón scáileán Beatha. Ní roinnimid do chuid sonraí le tríú páirtithe gan do thoiliú sainráite.",
      "dataCollectionText2": "*Sonraí faoi roghanna úsáideora: Le linn an phróisis chlárúcháin, bailímid sonraí a bhaineann le do roghanna, lena n-áirítear caitheamh aimsire, tréithe idéalacha do chomhluadair, agus roghanna amhairc. Úsáidtear an fhaisnéis seo chun d’eispéireas a phearsantú ar an ardán agus féadfar í a úsáid chun meaitseáil nó moltaí a dhéanamh. Féadfaidh tú teorainn a chur leis na roghanna sin a bhailítear le linn na clárúcháin más mian leat.",
      "howWeUseDataTitle": "Conas a Úsáidimid Do Shonraí",
      "howWeUseDataText": "Úsáidimid do shonraí chun ár seirbhísí a sholáthar agus chun d’eispéireas ar an ardán a fheabhsú. Áiríonn sé seo d’ainm úsáideora agus do phróifíl a úsáid chun deis a thabhairt duit idirghníomhú le húsáideoirí eile, ábhar a roinnt, agus páirt a ghlacadh i bplé ar an scáileán Beatha. Cabhraíonn do shonraí suímh linn ábhar áitiúil a sholáthar, agus tugann do roghanna agus sonraí próifíle deis dúinn moltaí, meaitseálacha, agus idirghníomhaíochtaí a chur in oiriúint do do thaitiní agus do roghanna. Déanaimid anailís ar do shonraí úsáide freisin chun feidhmiúlacht an ardáin a fheabhsú, gnéithe nua a fhorbairt, agus eispéireas rianúil a chinntiú. Ina theannta sin, d’fhéadfadh sé go n-úsáidfimid do sheoladh ríomhphoist chun fógraí agus nuashonruithe tábhachtacha a sheoladh maidir le do chuntas. Ní roinnimid do chuid sonraí le tríú páirtithe agus cinntímid go láimhseáiltear iad go slán agus de réir rialacháin príobháideachais.",
      "dataRetentionTitle": "Coinneáil Sonraí",
      "dataRetentionText": "Coinnímid do shonraí pearsanta ar feadh na tréimhse is gá chun ár seirbhísí a sholáthar agus chun ceanglais dlí a chomhlíonadh. Nuair a chríochnaíonn an rannpháirtíocht, trí scrios úsáideora nó trí dhul in éag, stóráiltear an meán agus na hiontrálacha téacs atá bainteach leis i gcomhad cartlainne. Bainistíonn ár soláthraí seirbhíse an comhad seo agus féadfar é a rochtain nuair is gá le haghaidh comhlíontachta, fabhtcheartaithe, nó de réir iarratais úsáideora. Má tá sé neamhúsáidte, scriosfar an comhad go slán tar éis tréimhse réamhshocraithe. Féadfaidh tú iarraidh go scriosfar an comhad cartlainne ag am ar bith de réir do chearta.",
      "rightsTitle": "Do Chearta",
      "rightsText": "Tá sé de cheart agat rochtain a fháil ar do chuid sonraí pearsanta, iad a mhodhnú, nó a scriosadh tráth ar bith. Áiríonn sé seo an ceart chun cóipeanna d’idirghníomhaíochtaí agus meáin a stóráiltear i do sheisiúin rannpháirtíochta a íoslódáil nó a iarraidh. Má roghnaíonn tú do chuid sonraí a scriosadh, bainfear iad as an gcóras de réir ár bpolasaí coinneála sonraí. Ina theannta sin, féadfaidh tú iarraidh go scriosfar comhad cartlainne sula mbainfear é de réir an sceidil. Tá sé de cheart agat teorainn a chur le bailiú áirithe sonraí freisin, rud a d’fhéadfadh tionchar a imirt ar roinnt gnéithe den aip.",
      "consentTitle": "Toiliú",
      "consentText": "Trí úsáid a bhaint as an aip seo, toilíonn tú lenár bpolasaí príobháideachais agus aontaíonn tú le bailiú, stóráil, agus úsáid do chuid faisnéise pearsanta mar atá leagtha amach. Aithníonn tú go bhféadfaí do chuid sonraí a chartlannú tar éis don rannpháirtíocht dul in éag chun comhlíonadh nó tagairt amach anseo, agus glacann tú leis na téarmaí a bhaineann leis an bpróiseas seo. Más mian leat do thoiliú a aistarraingt nó úsáid do shonraí a athrú ag am ar bith, féadfaidh tú do chearta a fheidhmiú mar atá leagtha amach thuas.",
      "contactInfo": "Má tá aon cheist agat, déan teagmháil linn ag connectedengaged@gmail.com.",
      "backToBase": "Ar Ais go dtí an Bonn"
    }
  },
  "pt": {
    "login": {
      "title": "Você está Conectado Engajado?",
      "helpMessage": "Gire as imagens para que fiquem na posição correta antes de fazer login. Por favor, aceite ou rejeite os cookies antes de fazer login.",
      "loginButton": "Entrar",
      "noAccountText": "Não tem uma conta?",
      "registerLink": "Cadastre-se aqui",
      "forgottenPasswordLink": "Esqueceu a senha?",
      "usernamePlaceholder": "Nome de usuário",
      "passwordPlaceholder": "Senha",
      "cookieConsent": "Opções de Consentimento de Cookies",
      "imageRotate": "Por favor, gire as imagens para a orientação correta antes de prosseguir.",
      "consent": {
        "customize": "Personalizar",
        "acceptAll": "Aceitar todos",
        "rejectAll": "Rejeitar todos",
        "info": "Informação"
      },
      "modalTitle": "Informações sobre Cookies",
      "closeButton": "Fechar",
      "rejectAllMessage": "Removemos todos os cookies",
      "infoMessage": "Usamos dois cookies para lembrar seu nome de usuário e preferência de idioma, evitando a necessidade de lembrá-los ou redefini-los em seu próximo login.",
      "customizeMessage": "Você pode aceitar ou rejeitar os cookies específicos do aplicativo.",
      "passwordLengthError": "A senha deve ter pelo menos 8 caracteres",
      "cookieConsentError": "Aceite ou rejeite os cookies antes de fazer login.",
      "imageOrientationError": "Posicione as imagens corretamente antes de enviar.",
      "loginSuccess": "Login realizado com sucesso",
      "loginFailed": "Falha no login",
      "loginFailedNetwork": "Falha no login devido a erro de rede",
      "privacyPolicyLink": "Política de Privacidade"
    },
    "privacyPolicy": {
      "title": "Política de Privacidade",
      "introductionTitle": "Introdução",
      "introductionText": "Estamos comprometidos em proteger suas informações pessoais e respeitar sua privacidade. Nossa Política de Privacidade descreve como tratamos seus dados, incluindo as informações que coletamos, como as utilizamos e seus direitos em relação às suas informações pessoais. Nosso objetivo é garantir transparência e dar a você controle sobre seus dados ao interagir com nossa plataforma. Ao utilizar nossos serviços, você concorda com a coleta e o uso das informações de acordo com esta política. Por favor, reserve um momento para revisá-la cuidadosamente. Este aplicativo é destinado a usuários com 18 anos ou mais.",
      "dataCollectionTitle": "Dados que Coletamos",
      "dataCollectionText": "Coletamos seu nome de usuário, endereço de e-mail, senha, foto de perfil, vídeo de perfil, dados de preferência do usuário*, informações sobre você e seu companheiro bot ideal, dados de localização (coordenadas), idioma preferido, país de residência, endereço IP registrado e histórico de interações na tela FeedScreen da plataforma. Não compartilhamos seus dados com terceiros sem o seu consentimento explícito.",
      "dataCollectionText2": "*Dados de preferência do usuário: Durante o processo de registro, coletamos dados relacionados às suas preferências, incluindo, entre outros, hobbies, características ideais de companhia e seleções visuais. Essas informações são usadas para personalizar sua experiência na plataforma e podem ser usadas para fins de correspondência ou recomendação. Você pode optar por limitar a coleta de certas preferências durante o registro.",
      "howWeUseDataTitle": "Como Utilizamos Seus Dados",
      "howWeUseDataText": "Utilizamos seus dados para fornecer nossos serviços e melhorar sua experiência na plataforma. Isso inclui o uso de seu nome de usuário e informações de perfil para permitir que você interaja com outros usuários, compartilhe conteúdo e participe de discussões na tela FeedScreen. Seus dados de localização nos ajudam a fornecer conteúdo localizado, enquanto suas preferências e detalhes de perfil permitem que adaptemos recomendações, correspondências e interações de acordo com seus interesses e preferências. Analisamos seus dados de uso para melhorar a funcionalidade da plataforma, desenvolver novos recursos e garantir uma experiência fluida e responsiva. Além disso, podemos usar seu endereço de e-mail para enviar notificações importantes e atualizações relacionadas à sua conta, bem como informações relevantes sobre a plataforma. Seus dados não são compartilhados com terceiros, e garantimos que sejam tratados com segurança e em conformidade com as regulamentações de privacidade.",
      "dataRetentionTitle": "Retenção de Dados",
      "dataRetentionText": "Retemos seus dados pessoais apenas pelo tempo necessário para fornecer nossos serviços e cumprir obrigações legais. Quando o engajamento termina, seja por exclusão pelo usuário ou expiração, todos os dados associados, como mídia e entradas de texto, são armazenados em um arquivo zip para arquivamento. Este arquivo é gerenciado por nosso provedor de serviços e pode ser acessado, se necessário, para conformidade, resolução de problemas ou mediante solicitação do usuário. Se não houver necessidade, o arquivo arquivado será excluído de forma segura após um período pré-determinado. Você pode solicitar a exclusão do arquivo arquivado a qualquer momento, de acordo com seus direitos.",
      "rightsTitle": "Seus Direitos",
      "rightsText": "Você tem o direito de acessar, modificar ou excluir seus dados pessoais a qualquer momento. Isso inclui o direito de baixar ou solicitar cópias de suas interações e mídias armazenadas em suas sessões de engajamento. Se optar por excluir seus dados, eles serão removidos do sistema de acordo com nossa política de retenção de dados. Além disso, você pode solicitar a exclusão de arquivos arquivados antes de sua exclusão programada. Você também tem o direito de limitar a coleta de determinados dados, o que pode afetar algumas funcionalidades do aplicativo.",
      "consentTitle": "Consentimento",
      "consentText": "Ao utilizar este aplicativo, você concorda com nossa política de privacidade e autoriza a coleta, armazenamento e uso de suas informações pessoais, conforme descrito. Você reconhece que seus dados podem ser arquivados após o término do engajamento para fins de conformidade ou referência futura, e aceita os termos desse processo. Caso deseje retirar seu consentimento ou alterar o uso de seus dados, você pode exercer seus direitos conforme descrito acima. Um consentimento explícito será exigido antes da coleta de dados sensíveis, como localização ou preferências do usuário.",
      "contactInfo": "Se você tiver alguma dúvida, entre em contato conosco pelo e-mail connectedengaged@gmail.com.",
      "backToBase": "Voltar à Base"
    }
  },
  "hi": {
    "login": {
      "title": "क्या आप कनेक्टेड एंगेज्ड हैं?",
      "helpMessage": "लॉगिन करने से पहले छवियों को सही तरीके से घुमाएँ। कृपया कुकीज़ को स्वीकार या अस्वीकार करें।",
      "loginButton": "लॉगिन",
      "noAccountText": "कोई खाता नहीं है?",
      "registerLink": "यहाँ रजिस्टर करें",
      "forgottenPasswordLink": "पासवर्ड भूल गए?",
      "usernamePlaceholder": "उपयोगकर्ता नाम",
      "passwordPlaceholder": "पासवर्ड",
      "cookieConsent": "कुकी सहमति विकल्प",
      "imageRotate": "कृपया छवियों को सही दिशा में घुमाएँ।",
      "consent": {
        "customize": "अनुकूलित करें",
        "acceptAll": "सभी स्वीकार करें",
        "rejectAll": "सभी अस्वीकार करें",
        "info": "जानकारी"
      },
      "modalTitle": "कुकी जानकारी",
      "closeButton": "बंद करें",
      "rejectAllMessage": "हमने सभी कुकीज़ हटा दी हैं।",
      "infoMessage": "हमारे पास दो कुकीज़ हैं जो आपका उपयोगकर्ता नाम और भाषा पसंद याद रखने के लिए हैं।",
      "customizeMessage": "आप ऐप विशिष्ट कुकीज़ को स्वीकार या अस्वीकार कर सकते हैं।",
      "passwordLengthError": "पासवर्ड कम से कम 8 वर्ण का होना चाहिए।",
      "cookieConsentError": "लॉगिन से पहले कृपया कुकीज़ को स्वीकार या अस्वीकार करें।",
      "imageOrientationError": "प्रस्तुत करने से पहले कृपया छवियों को सही दिशा में घुमाएँ।",
      "loginSuccess": "लॉगिन सफल।",
      "loginFailed": "लॉगिन विफल।",
      "loginFailedNetwork": "नेटवर्क त्रुटि के कारण लॉगिन विफल।",
      "privacyPolicyLink": "गोपनीयता नीति"
    },
    "privacyPolicy": {
      "title": "गोपनीयता नीति",
      "introductionTitle": "परिचय",
      "introductionText": "हम आपकी व्यक्तिगत जानकारी की सुरक्षा के प्रति प्रतिबद्ध हैं। हमारी गोपनीयता नीति बताती है कि हम आपके डेटा को कैसे संभालते हैं।",
      "dataCollectionTitle": "हम जो डेटा एकत्र करते हैं",
      "dataCollectionText": "हम उपयोगकर्ता नाम, ईमेल, पासवर्ड, और अन्य जानकारी एकत्र करते हैं।",
      "dataCollectionText2": "यह जानकारी आपकी सुविधा और सिफारिशों को बेहतर बनाने के लिए उपयोग की जाती है।",
      "howWeUseDataTitle": "हम आपके डेटा का उपयोग कैसे करते हैं",
      "howWeUseDataText": "हम आपके अनुभव को व्यक्तिगत बनाने और सेवाएँ प्रदान करने के लिए डेटा का उपयोग करते हैं।",
      "dataRetentionTitle": "डेटा संग्रहण",
      "dataRetentionText": "हम आपके डेटा को केवल आवश्यक अवधि तक रखते हैं।",
      "rightsTitle": "आपके अधिकार",
      "rightsText": "आप किसी भी समय अपने डेटा को एक्सेस, संशोधित, या हटा सकते हैं।",
      "consentTitle": "सहमति",
      "consentText": "इस ऐप का उपयोग करके, आप हमारी गोपनीयता नीति से सहमत हैं।",
      "contactInfo": "किसी भी प्रश्न के लिए connectedengaged@gmail.com पर संपर्क करें।",
      "backToBase": "मुख पृष्ठ पर वापस जाएँ।"
    }
  },
  "hy": {
    "login": {
      "title": "Դուք միացա՞ծ եք:",
      "helpMessage": "Մուտք գործելուց առաջ պտտեք պատկերները ճիշտ կողմնորոշմամբ։ Խնդրում ենք ընդունել կամ մերժել քուքիները:",
      "loginButton": "Մուտք գործել",
      "noAccountText": "Դեռ չունե՞ք հաշիվ:",
      "registerLink": "Գրանցվեք այստեղ",
      "forgottenPasswordLink": "Մոռացե՞լ եք գաղտնաբառը:",
      "usernamePlaceholder": "Օգտանուն",
      "passwordPlaceholder": "Գաղտնաբառ",
      "cookieConsent": "Քուքի համաձայնության ընտրանքներ",
      "imageRotate": "Խնդրում ենք ճիշտ կողմնորոշել պատկերները՝ շարունակելու համար։",
      "consent": {
        "customize": "Հարմարեցնել",
        "acceptAll": "Ընդունել բոլորը",
        "rejectAll": "Մերժել բոլորը",
        "info": "Տեղեկատվություն"
      },
      "modalTitle": "Քուքի տեղեկատվություն",
      "closeButton": "Փակել",
      "rejectAllMessage": "Մենք հեռացրել ենք բոլոր քուքիները։",
      "infoMessage": "Մենք ունենք երկու քուքի՝ ձեր օգտանունը և լեզվի նախապատվությունը հիշելու համար։",
      "customizeMessage": "Դուք կարող եք ընդունել կամ մերժել հավելվածի քուքիները։",
      "passwordLengthError": "Գաղտնաբառը պետք է լինի առնվազն 8 նիշ։",
      "cookieConsentError": "Մուտք գործելուց առաջ խնդրում ենք ընդունել կամ մերժել քուքիները։",
      "imageOrientationError": "Խնդրում ենք ճիշտ կողմնորոշել պատկերները՝ ներկայացնելուց առաջ։",
      "loginSuccess": "Մուտքը հաջողվեց։",
      "loginFailed": "Մուտքը ձախողվեց։",
      "loginFailedNetwork": "Մուտքը ձախողվեց ցանցի սխալի պատճառով։",
      "privacyPolicyLink": "Գաղտնիության քաղաքականություն"
    },
    "privacyPolicy": {
      "title": "Գաղտնիության քաղաքականություն",
      "introductionTitle": "Ներածություն",
      "introductionText": "Մենք հանձնառու ենք պաշտպանելու ձեր անձնական տվյալները։ Մեր քաղաքականությունը բացատրում է տվյալների հավաքման և օգտագործման գործընթացը։",
      "dataCollectionTitle": "Մենք հավաքում ենք",
      "dataCollectionText": "Մենք հավաքում ենք օգտանուններ, էլ․ հասցեներ և այլ տվյալներ։",
      "dataCollectionText2": "Այս տվյալներն օգտագործվում են հավելվածի աշխատանքը բարելավելու նպատակով։",
      "howWeUseDataTitle": "Ինչպես ենք մենք օգտագործում տվյալները",
      "howWeUseDataText": "Մենք օգտագործում ենք տվյալները՝ ծառայությունների որակը բարձրացնելու համար։",
      "dataRetentionTitle": "Տվյալների պահպանում",
      "dataRetentionText": "Մենք տվյալները պահում ենք միայն անհրաժեշտ ժամանակահատվածում։",
      "rightsTitle": "Ձեր իրավունքները",
      "rightsText": "Դուք կարող եք ցանկացած պահի մուտք գործել, փոփոխել կամ ջնջել ձեր տվյալները։",
      "consentTitle": "Համաձայնություն",
      "consentText": "Այս հավելվածի օգտագործմամբ՝ դուք համաձայնվում եք մեր գաղտնիության քաղաքականությանը։",
      "contactInfo": "Հարցերի դեպքում՝ դիմեք connectedengaged@gmail.com հասցեին։",
      "backToBase": "Վերադառնալ հիմնական էջ։"
    }
  }
}
