{
  "en": {
    "login": {
      "title": "Are you Connected Engaged?",
      "helpMessage": "Rotate the images so they are the right way up before Logging in. Please Accept or Reject Cookies before logging in.",
      "loginButton": "Login",
      "noAccountText": "Don't have an account?",
      "registerLink": "Register here",
      "forgottenPasswordLink": "Forgotten password?",
      "consent": {
        "customize": "Customize",
        "acceptAll": "Accept All",
        "rejectAll": "Reject All",
        "info": "Information"
      },
      "modalTitle": "Cookie Information",
      "closeButton": "Close",
      "rejectAllMessage": "We have removed all cookies",
      "infoMessage": "We have two cookies which are for remembering your username and your language preference to remove the inconvenience of remembering your username or having to reselect your language preference the next time you login",
      "customizeMessage": "You can either accept the application specific cookies or reject them.",
      "passwordLengthError": "Password must be at least 8 characters",
      "cookieConsentError": "Please accept or reject cookies before logging in.",
      "imageOrientationError": "Please correctly orient the images before submitting.",
      "loginSuccess": "Login successful",
      "loginFailed": "Login failed",
      "loginFailedNetwork": "Login failed due to network error",
      "privacyPolicyLink": "Privacy Policy"
    },
    "privacyPolicy": {
      "title": "Privacy Policy",
      "introductionTitle": "Introduction",
      "introductionText": "We are committed to protecting your personal information and respecting your privacy. Our Privacy Policy outlines how we handle your data, including what information we collect, how we use it, and your rights regarding your personal information. We aim to ensure transparency and give you control over your data as you interact with our platform. By using our services, you agree to the collection and use of information in accordance with this policy. Please take a moment to review it carefully.",
      "dataCollectionTitle": "Data We Collect",
      "dataCollectionText": "We collect your username, email address, password, profile picture, profile video, user preference data*, information about yourself and your ideal bot companion, location data (coordinates), preferred language, country of residence, registered IP address, and interaction history from the platform's FeedScreen.",
      "dataCollectionText2": "*user preference data: During the Registration process, we collect data related to your preferences, including but not limited to hobbies, ideal companionship traits, and visual selections. This information is used to personalize your experience on the platform and may be used for matching or recommendation purposes",
      "howWeUseDataTitle": "How We Use Your Data",
      "howWeUseDataText": "We use your data to provide our services and enhance your experience on the platform. This includes using your username and profile information to allow you to interact with other users, share content, and participate in the FeedScreen discussions. Your location data helps us to provide localized content, while your preferences and profile details allow us to tailor recommendations, matches, and interactions to align with your interests and preferences. Your usage data is analyzed to improve the functionality of the platform, develop new features, and ensure a smooth and responsive user experience. Additionally, we may use your email address to send you important notifications and updates regarding your account, as well as relevant platform information. We ensure that your data is handled securely and in compliance with privacy regulations.",
      "dataRetentionTitle": "Data Retention",
      "dataRetentionText": "We retain your personal data only for as long as necessary to provide our services and comply with legal obligations. Once the engagement ends, whether by user deletion or expiration, all associated media and text entries are stored in a zip file for archival purposes. This archived data is managed by our service provider and can be accessed if necessary for compliance, troubleshooting, or upon user request. However, if no such need arises, the archived data will be securely deleted after a predefined period.",
      "rightsTitle": "Your Rights",
      "rightsText": "You have the right to access, modify, or delete your personal data at any time. This includes the right to download or request copies of your interactions and media stored in your engagement sessions. If you choose to delete your data, it will be removed from the system in accordance with our data retention policy. Additionally, you may request the removal of archived data before its scheduled deletion.",
      "consentTitle": "Consent",
      "consentText": "By using this app, you consent to our privacy policy and agree to the collection, storage, and use of your personal information as described. You acknowledge that your data may be archived after engagement expiration for compliance or future reference, and you accept the terms of this process. If at any point you wish to withdraw your consent or alter the use of your data, you can exercise your rights as outlined above.",
      "contactInfo": "For any questions, contact us at connectedengaged@gmail.com.",
      "backToBase": "Back to Base"
    }
  },
  "es": {
    "login": {
      "title": "¿Estás Conectado Comprometido?",
      "helpMessage": "Gira las imágenes para que estén del lado correcto antes de iniciar sesión. Acepte o rechace las cookies antes de iniciar sesión.",
      "loginButton": "Iniciar sesión",
      "noAccountText": "¿No tienes una cuenta?",
      "registerLink": "Regístrate aquí",
      "forgottenPasswordLink": "¿Olvidaste tu contraseña?",
      "consent": {
        "customize": "Personalizar",
        "acceptAll": "Aceptar todo",
        "rejectAll": "Rechazar todo",
        "info": "Información"
      },
      "modalTitle": "Información de cookies",
      "closeButton": "Cerrar",
      "rejectAllMessage": "Hemos eliminado todas las cookies",
      "infoMessage": "Tenemos dos cookies para recordar tu nombre de usuario y tu preferencia de idioma para evitar la molestia de tener que recordar tu nombre de usuario o volver a seleccionar tu preferencia de idioma la próxima vez que inicies sesión",
      "customizeMessage": "Puedes aceptar las cookies específicas de la aplicación o rechazarlas.",
      "passwordLengthError": "La contraseña debe tener al menos 8 caracteres",
      "cookieConsentError": "Por favor, acepte o rechace las cookies antes de iniciar sesión.",
      "imageOrientationError": "Por favor, oriente correctamente las imágenes antes de enviar.",
      "loginSuccess": "Inicio de sesión exitoso",
      "loginFailed": "Inicio de sesión fallido",
      "loginFailedNetwork": "Error de inicio de sesión debido a un error de red",
      "privacyPolicyLink": "Política de Privacidad"
    },
    "privacyPolicy": {
      "title": "Política de Privacidad",
      "introductionTitle": "Introducción",
      "introductionText": "Recopilamos su nombre de usuario, dirección de correo electrónico, contraseña, foto de perfil, video de perfil, orientación sexual, pasatiempos, preferencias, género, información sobre usted y su compañero ideal de bot, datos de ubicación (coordenadas), idioma preferido, país de residencia, dirección IP registrada e historial de interacción de la pantalla FeedScreen de la plataforma.",
      "dataCollectionTitle": "Datos que Recopilamos",
      "dataCollectionText": "Recopilamos su nombre de usuario, dirección de correo electrónico, contraseña, foto de perfil, video de perfil, datos de preferencia del usuario*, \n información sobre usted y su compañero de bot ideal, datos de ubicación (coordenadas), idioma preferido, país de residencia, dirección IP registrada y el historial de interacciones de la plataforma FeedScreen.",
      "dataCollectionText2": "*Datos de Preferencia del Usuario: Durante el proceso de registro, recopilamos datos relacionados con sus preferencias, incluidas pero no limitadas a aficiones, rasgos de compañía ideal y selecciones visuales. Esta información se utiliza para personalizar su experiencia en la plataforma y puede utilizarse para fines de emparejamiento o recomendaciones.",
      "howWeUseDataTitle": "Cómo Usamos sus Datos",
      "howWeUseDataText": "Usamos sus datos para brindar nuestros servicios y mejorar su experiencia en la plataforma. Esto incluye el uso de su nombre de usuario y la información de su perfil para permitirle interactuar con otros usuarios, compartir contenido y participar en discusiones de FeedScreen. Sus datos de ubicación nos ayudan a proporcionar contenido localizado, mientras que sus preferencias y detalles de perfil nos permiten personalizar recomendaciones, coincidencias e interacciones para alinearse con sus intereses y preferencias. Sus datos de uso se analizan para mejorar la funcionalidad de la plataforma, desarrollar nuevas funciones y garantizar una experiencia de usuario fluida y receptiva. Además, podemos usar su dirección de correo electrónico para enviarle notificaciones importantes y actualizaciones sobre su cuenta, así como información relevante sobre la plataforma. Nos aseguramos de que sus datos se manejen de forma segura y en cumplimiento con las regulaciones de privacidad.",
      "dataRetentionTitle": "Retención de Datos",
      "dataRetentionText": "Retenemos sus datos personales solo durante el tiempo necesario para proporcionar nuestros servicios y cumplir con las obligaciones legales. Una vez que la interacción termina, ya sea por eliminación del usuario o por expiración, todos los medios asociados y entradas de texto se almacenan en un archivo zip con fines de archivo. Estos datos archivados son gestionados por nuestro proveedor de servicios y pueden ser accedidos si es necesario para cumplimiento, solución de problemas o a solicitud del usuario. Sin embargo, si no surge tal necesidad, los datos archivados se eliminarán de manera segura después de un período de tiempo predefinido.",
      "rightsTitle": "Sus Derechos",
      "rightsText": "Tiene el derecho de acceder, modificar o eliminar sus datos personales en cualquier momento. Esto incluye el derecho de descargar o solicitar copias de sus interacciones y medios almacenados en sus sesiones de interacción. Si elige eliminar sus datos, serán eliminados del sistema de acuerdo con nuestra política de retención de datos. Además, puede solicitar la eliminación de datos archivados antes de su eliminación programada.",
      "consentTitle": "Consentimiento",
      "consentText": "Al utilizar esta aplicación, usted acepta nuestra política de privacidad y da su consentimiento para la recopilación, almacenamiento y uso de su información personal según lo descrito. Reconoce que sus datos pueden ser archivados después de la expiración del compromiso por motivos de cumplimiento o para referencia futura, y acepta los términos de este proceso. Si en algún momento desea retirar su consentimiento o modificar el uso de sus datos, puede ejercer sus derechos como se describe anteriormente.",
      "contactInfo": "Para cualquier consulta, contáctenos en connectedengaged@gmail.com.",
      "backToBase": "Volver al inicio"
    }
  },
  "fr": {
    "login": {
      "title": "Êtes-vous Connecté Engagé?",
      "helpMessage": "Faites pivoter les images pour qu'elles soient dans le bon sens avant de vous connecter. Veuillez accepter ou rejeter les cookies avant de vous connecter.",
      "loginButton": "Connexion",
      "noAccountText": "Vous n'avez pas de compte?",
      "registerLink": "Inscrivez-vous ici",
      "forgottenPasswordLink": "Mot de passe oublié?",
      "consent": {
        "customize": "Personnaliser",
        "acceptAll": "Tout accepter",
        "rejectAll": "Tout rejeter",
        "info": "Information"
      },
      "modalTitle": "Informations sur les cookies",
      "closeButton": "Fermer",
      "rejectAllMessage": "Nous avons supprimé tous les cookies",
      "infoMessage": "Nous avons deux cookies pour mémoriser votre nom d'utilisateur et votre préférence de langue afin d'éviter la gêne de devoir mémoriser votre nom d'utilisateur ou de devoir à nouveau sélectionner votre préférence de langue la prochaine fois que vous vous connectez",
      "customizeMessage": "Vous pouvez accepter les cookies spécifiques à l'application ou les rejeter.",
      "passwordLengthError": "Le mot de passe doit comporter au moins 8 caractères",
      "cookieConsentError": "Veuillez accepter ou refuser les cookies avant de vous connecter.",
      "imageOrientationError": "Veuillez orienter correctement les images avant de soumettre.",
      "loginSuccess": "Connexion réussie",
      "loginFailed": "Échec de la connexion",
      "loginFailedNetwork": "Échec de la connexion en raison d'une erreur réseau",
      "privacyPolicyLink": "Politique de Confidentialité"
    },
    "privacyPolicy": {
      "title": "Politique de Confidentialité",
      "introductionTitle": "Introduction",
      "introductionText": "Nous collectons votre nom d'utilisateur, adresse e-mail, mot de passe, photo de profil, vidéo de profil, orientation sexuelle, loisirs, préférences, sexe, informations sur vous et votre compagnon de bot idéal, données de localisation (coordonnées), langue préférée, pays de résidence, adresse IP enregistrée et historique des interactions à partir de l'écran FeedScreen de la plateforme.",
      "dataCollectionTitle": "Données que Nous Collectons",
      "dataCollectionText": "Nous recueillons votre nom d'utilisateur, votre adresse e-mail, votre mot de passe, votre photo de profil, votre vidéo de profil, les données de préférence utilisateur*, \n des informations sur vous-même et votre compagnon bot idéal, des données de localisation (coordonnées), la langue préférée, le pays de résidence, l'adresse IP enregistrée et l'historique d'interactions sur le FeedScreen de la plateforme.",
      "dataCollectionText2": "*Données de Préférence Utilisateur : Lors du processus d'inscription, nous recueillons des données liées à vos préférences, y compris mais sans s'y limiter, les passe-temps, les caractéristiques de compagnie idéale et les sélections visuelles. Ces informations sont utilisées pour personnaliser votre expérience sur la plateforme et peuvent être utilisées pour des recommandations ou des correspondances.",
      "howWeUseDataTitle": "Comment Nous Utilisons Vos Données",
      "howWeUseDataText": "Nous utilisons vos données pour fournir nos services et améliorer votre expérience sur la plateforme. Cela inclut l'utilisation de votre nom d'utilisateur et des informations de profil pour vous permettre d'interagir avec d'autres utilisateurs, de partager du contenu et de participer aux discussions de FeedScreen. Vos données de localisation nous aident à fournir un contenu localisé, tandis que vos préférences et les détails de votre profil nous permettent de personnaliser les recommandations, les correspondances et les interactions en fonction de vos intérêts et préférences. Vos données d'utilisation sont analysées pour améliorer la fonctionnalité de la plateforme, développer de nouvelles fonctionnalités et garantir une expérience utilisateur fluide et réactive. De plus, nous pouvons utiliser votre adresse e-mail pour vous envoyer des notifications importantes et des mises à jour concernant votre compte, ainsi que des informations pertinentes sur la plateforme. Nous veillons à ce que vos données soient traitées de manière sécurisée et en conformité avec les réglementations sur la confidentialité.",
      "dataRetentionTitle": "Conservation des Données",
      "dataRetentionText": "Nous conservons vos données personnelles uniquement pendant le temps nécessaire à la fourniture de nos services et au respect de nos obligations légales. Une fois l'engagement terminé, que ce soit par suppression de l'utilisateur ou par expiration, tous les médias et entrées de texte associés sont stockés dans un fichier zip à des fins d'archivage. Ces données archivées sont gérées par notre prestataire de services et peuvent être consultées si nécessaire pour des raisons de conformité, de dépannage ou sur demande de l'utilisateur. Toutefois, si aucune de ces nécessités ne se présente, les données archivées seront supprimées en toute sécurité après une période prédéfinie.",
      "rightsTitle": "Vos Droits",
      "rightsText": "Vous avez le droit d'accéder à vos données personnelles, de les modifier ou de les supprimer à tout moment. Cela inclut le droit de télécharger ou de demander des copies de vos interactions et des médias stockés dans vos sessions d'engagement. Si vous choisissez de supprimer vos données, elles seront supprimées du système conformément à notre politique de conservation des données. De plus, vous pouvez demander la suppression des données archivées avant leur suppression programmée.",
      "consentTitle": "Consentement",
      "consentText": "En utilisant cette application, vous consentez à notre politique de confidentialité et acceptez la collecte, le stockage et l'utilisation de vos informations personnelles telles que décrites. Vous reconnaissez que vos données peuvent être archivées après l'expiration de l'engagement pour des raisons de conformité ou de référence future, et vous acceptez les termes de ce processus. Si à tout moment vous souhaitez retirer votre consentement ou modifier l'utilisation de vos données, vous pouvez exercer vos droits comme indiqué ci-dessus.",
      "contactInfo": "Si vous avez des questions ou des préoccupations concernant cette politique de confidentialité, veuillez nous contacter à connectedengaged@gmail.com.",
      "backToBase": "Retour à la base"
    }
  },
  "de": {
    "login": {
      "title": "Bist du Verbunden Engagiert?",
      "helpMessage": "Drehen Sie die Bilder, damit sie richtig sind, bevor Sie sich einloggen. Bitte akzeptieren oder lehnen Sie Cookies ab, bevor Sie sich einloggen.",
      "loginButton": "Anmelden",
      "noAccountText": "Haben Sie kein Konto?",
      "registerLink": "Hier registrieren",
      "forgottenPasswordLink": "Passwort vergessen?",
      "consent": {
        "customize": "Anpassen",
        "acceptAll": "Alles akzeptieren",
        "rejectAll": "Alles ablehnen",
        "info": "Information"
      },
      "modalTitle": "Cookie-Informationen",
      "closeButton": "Schließen",
      "rejectAllMessage": "Wir haben alle Cookies entfernt",
      "infoMessage": "Wir haben zwei Cookies, die dazu dienen, Ihren Benutzernamen und Ihre Sprachpräferenz zu speichern, um die Unannehmlichkeit zu vermeiden, sich an Ihren Benutzernamen erinnern oder Ihre Sprachpräferenz beim nächsten Login erneut auswählen zu müssen",
      "customizeMessage": "Sie können die anwendungsspezifischen Cookies entweder akzeptieren oder ablehnen.",
      "passwordLengthError": "Das Passwort muss mindestens 8 Zeichen lang sein",
      "cookieConsentError": "Bitte akzeptieren oder lehnen Sie Cookies ab, bevor Sie sich einloggen.",
      "imageOrientationError": "Bitte richten Sie die Bilder korrekt aus, bevor Sie sie einreichen.",
      "loginSuccess": "Anmeldung erfolgreich",
      "loginFailed": "Anmeldung fehlgeschlagen",
      "loginFailedNetwork": "Anmeldung aufgrund eines Netzwerkfehlers fehlgeschlagen",
      "privacyPolicyLink": "Datenschutzerklärung"
    },
    "privacyPolicy": {
      "title": "Datenschutzrichtlinie",
      "introductionTitle": "Einführung",
      "introductionText": "Wir sind bestrebt, Ihre persönlichen Daten und Ihr Recht auf Privatsphäre zu schützen. Diese Datenschutzrichtlinie beschreibt, wie wir Ihre Informationen sammeln, verwenden und schützen, wenn Sie unsere App verwenden.",
      "dataCollectionTitle": "Daten, die Wir Sammeln",
      "dataCollectionText": "Wir erfassen Ihren Benutzernamen, Ihre E-Mail-Adresse, Ihr Passwort, Ihr Profilbild, Ihr Profilvideo, Benutzerpräferenzdaten*, \n Informationen über Sie und Ihren idealen Bot-Begleiter, Standortdaten (Koordinaten), bevorzugte Sprache, Wohnsitzland, registrierte IP-Adresse und Interaktionshistorie vom FeedScreen der Plattform.",
      "dataCollectionText2": "*Benutzerpräferenzdaten: Während des Registrierungsprozesses sammeln wir Daten zu Ihren Vorlieben, einschließlich, aber nicht beschränkt auf Hobbys, ideale Begleitermerkmale und visuelle Auswahlen. Diese Informationen werden verwendet, um Ihre Erfahrung auf der Plattform zu personalisieren und können für Abgleichs- oder Empfehlungsszwecke verwendet werden.",
      "howWeUseDataTitle": "Wie Wir Ihre Daten Verwenden",
      "howWeUseDataText": "Wir verwenden Ihre Daten, um unsere Dienste bereitzustellen und Ihre Erfahrung auf der Plattform zu verbessern. Dazu gehört die Nutzung Ihres Benutzernamens und Ihrer Profildaten, um Ihnen die Interaktion mit anderen Nutzern, das Teilen von Inhalten und die Teilnahme an Diskussionen auf dem FeedScreen zu ermöglichen. Ihre Standortdaten helfen uns, lokalisierte Inhalte bereitzustellen, während Ihre Präferenzen und Profildetails uns ermöglichen, Empfehlungen, Übereinstimmungen und Interaktionen an Ihre Interessen und Vorlieben anzupassen. Ihre Nutzungsdaten werden analysiert, um die Funktionalität der Plattform zu verbessern, neue Funktionen zu entwickeln und eine reibungslose und reaktionsschnelle Benutzererfahrung zu gewährleisten. Darüber hinaus können wir Ihre E-Mail-Adresse verwenden, um Ihnen wichtige Benachrichtigungen und Updates zu Ihrem Konto sowie relevante Informationen zur Plattform zu senden. Wir stellen sicher, dass Ihre Daten sicher behandelt werden und den Datenschutzbestimmungen entsprechen.",
      "dataRetentionTitle": "Datenaufbewahrung",
      "dataRetentionText": "Wir speichern Ihre persönlichen Daten nur so lange, wie es zur Bereitstellung unserer Dienstleistungen und zur Erfüllung rechtlicher Verpflichtungen erforderlich ist. Sobald das Engagement endet, sei es durch Löschung durch den Benutzer oder durch Ablauf, werden alle zugehörigen Medien und Texteingaben in einer Zip-Datei zu Archivierungszwecken gespeichert. Diese archivierten Daten werden von unserem Dienstanbieter verwaltet und können bei Bedarf für die Einhaltung von Vorschriften, zur Fehlersuche oder auf Anfrage des Benutzers abgerufen werden. Wenn kein solcher Bedarf besteht, werden die archivierten Daten nach einer vordefinierten Frist sicher gelöscht.",
      "rightsTitle": "Ihre Rechte",
      "rightsText": "Sie haben das Recht, jederzeit auf Ihre persönlichen Daten zuzugreifen, diese zu ändern oder zu löschen. Dies schließt das Recht ein, Kopien Ihrer Interaktionen und Medien, die in Ihren Engagement-Sitzungen gespeichert sind, herunterzuladen oder anzufordern. Wenn Sie sich dafür entscheiden, Ihre Daten zu löschen, werden diese gemäß unserer Datenaufbewahrungsrichtlinie aus dem System entfernt. Darüber hinaus können Sie die Löschung archivierter Daten vor deren geplanten Löschung anfordern.",
      "consentTitle": "Einwilligung",
      "consentText": "Durch die Nutzung dieser App stimmen Sie unserer Datenschutzrichtlinie zu und erklären sich mit der Erfassung, Speicherung und Nutzung Ihrer persönlichen Informationen einverstanden, wie beschrieben. Sie erkennen an, dass Ihre Daten nach Ablauf des Engagements zu Compliance-Zwecken oder zur zukünftigen Referenz archiviert werden können, und akzeptieren die Bedingungen dieses Prozesses. Wenn Sie zu irgendeinem Zeitpunkt Ihre Zustimmung zurückziehen oder die Verwendung Ihrer Daten ändern möchten, können Sie Ihre oben beschriebenen Rechte ausüben.",
      "contactInfo": "Wenn Sie Fragen oder Bedenken zu dieser Datenschutzrichtlinie haben, kontaktieren Sie uns bitte unter connectedengaged@gmail.com.",
      "backToBase": "Zurück zur Basis"
    }
  },
  "ar": {
    "login": {
      "title": "هل أنت متصل وملتزم؟",
      "helpMessage": "قم بتدوير الصور بحيث تكون في الاتجاه الصحيح قبل تسجيل الدخول. الرجاء قبول أو رفض ملفات تعريف الارتباط قبل تسجيل الدخول.",
      "loginButton": "تسجيل الدخول",
      "noAccountText": "ليس لديك حساب؟",
      "registerLink": "سجل هنا",
      "forgottenPasswordLink": "نسيت كلمة المرور؟",
      "consent": {
        "customize": "تخصيص",
        "acceptAll": "قبول الكل",
        "rejectAll": "رفض الكل",
        "info": "معلومات"
      },
      "modalTitle": "معلومات ملفات تعريف الارتباط",
      "closeButton": "إغلاق",
      "rejectAllMessage": "لقد أزلنا جميع ملفات تعريف الارتباط",
      "infoMessage": "لدينا ملفا تعريف ارتباط لتذكر اسم المستخدم وتفضيل اللغة الخاص بك لتجنب متاعب تذكر اسم المستخدم الخاص بك أو الحاجة إلى إعادة تحديد تفضيل اللغة الخاص بك في المرة التالية التي تقوم فيها بتسجيل الدخول",
      "customizeMessage": "يمكنك إما قبول ملفات تعريف الارتباط الخاصة بالتطبيق أو رفضها.",
      "passwordLengthError": "يجب أن تكون كلمة المرور مكونة من 8 أحرف على الأقل",
      "cookieConsentError": "يرجى قبول أو رفض ملفات تعريف الارتباط قبل تسجيل الدخول.",
      "imageOrientationError": "يرجى توجيه الصور بشكل صحيح قبل الإرسال.",
      "loginSuccess": "تم تسجيل الدخول بنجاح",
      "loginFailed": "فشل تسجيل الدخول",
      "loginFailedNetwork": "فشل تسجيل الدخول بسبب خطأ في الشبكة",
      "privacyPolicyLink": "سياسة الخصوصية"
    },
    "privacyPolicy": {
      "title": "سياسة الخصوصية",
      "introductionTitle": "مقدمة",
      "introductionText": "نقوم بجمع اسم المستخدم الخاص بك، عنوان البريد الإلكتروني، كلمة المرور، صورة الملف الشخصي، فيديو الملف الشخصي، التوجه الجنسي، الهوايات، التفضيلات، الجنس، معلومات عنك وعن رفيق البوت المثالي الخاص بك، بيانات الموقع (الإحداثيات)، اللغة المفضلة، بلد الإقامة، عنوان IP المسجل، وتاريخ التفاعل من شاشة FeedScreen الخاصة بالمنصة.",
      "dataCollectionTitle": "البيانات التي نجمعها",
      "dataCollectionText": "نجمع اسم المستخدم الخاص بك، عنوان بريدك الإلكتروني، كلمة المرور، صورة الملف الشخصي، فيديو الملف الشخصي، بيانات التفضيلات الخاصة بالمستخدم*، \n معلومات عنك وعن رفيق الروبوت المثالي، بيانات الموقع (الإحداثيات)، اللغة المفضلة، بلد الإقامة، عنوان IP المسجل، وتاريخ التفاعل من FeedScreen على المنصة.",
      "dataCollectionText2": "*بيانات تفضيلات المستخدم: أثناء عملية التسجيل، نجمع البيانات المتعلقة بتفضيلاتك، بما في ذلك على سبيل المثال لا الحصر الهوايات، السمات المفضلة لرفيقك المثالي، والاختيارات المرئية. تُستخدم هذه المعلومات لتخصيص تجربتك على المنصة وقد تُستخدم لأغراض المطابقة أو التوصيات.",
      "howWeUseDataTitle": "كيفية استخدامنا لبياناتك",
      "howWeUseDataText": "نستخدم بياناتك لتقديم خدماتنا وتحسين تجربتك على المنصة. يشمل ذلك استخدام اسم المستخدم ومعلومات الملف الشخصي للسماح لك بالتفاعل مع المستخدمين الآخرين، ومشاركة المحتوى، والمشاركة في مناقشات FeedScreen. تساعدنا بيانات موقعك في تقديم محتوى محلي، بينما تتيح لنا تفضيلاتك وتفاصيل ملفك الشخصي تخصيص التوصيات والمطابقات والتفاعلات بما يتماشى مع اهتماماتك وتفضيلاتك. يتم تحليل بيانات استخدامك لتحسين وظائف المنصة، وتطوير ميزات جديدة، وضمان تجربة مستخدم سلسة وسريعة الاستجابة. بالإضافة إلى ذلك، قد نستخدم عنوان بريدك الإلكتروني لإرسال إشعارات مهمة وتحديثات بخصوص حسابك، بالإضافة إلى معلومات ذات صلة بالمنصة. نحن نضمن التعامل مع بياناتك بأمان ووفقًا للوائح الخصوصية.",
      "dataRetentionTitle": "الاحتفاظ بالبيانات",
      "dataRetentionText": "نحتفظ ببياناتك الشخصية فقط طالما كان ذلك ضروريًا لتقديم خدماتنا والامتثال للالتزامات القانونية. بمجرد انتهاء الاشتراك، سواء بحذف المستخدم أو بانتهاء الصلاحية، يتم تخزين جميع الوسائط المدخلة والنصوص المرتبطة في ملف مضغوط لأغراض الأرشفة. تتم إدارة هذه البيانات المؤرشفة من قبل مزود الخدمة الخاص بنا ويمكن الوصول إليها إذا لزم الأمر للامتثال، أو لحل المشكلات، أو بناءً على طلب المستخدم. ومع ذلك، إذا لم تكن هناك حاجة لمثل هذه البيانات، فسيتم حذف البيانات المؤرشفة بشكل آمن بعد فترة زمنية محددة مسبقًا.",
      "rightsTitle": "حقوقك",
      "rightsText": "لديك الحق في الوصول إلى بياناتك الشخصية أو تعديلها أو حذفها في أي وقت. يشمل ذلك الحق في تنزيل أو طلب نسخ من تفاعلاتك والوسائط المخزنة في جلسات تفاعلك. إذا اخترت حذف بياناتك، فسيتم إزالتها من النظام وفقًا لسياسة الاحتفاظ بالبيانات الخاصة بنا. بالإضافة إلى ذلك، يمكنك طلب إزالة البيانات المؤرشفة قبل حذفها المقرر.",
      "consentTitle": "الموافقة",
      "consentText": "باستخدامك لهذا التطبيق، فإنك توافق على سياسة الخصوصية الخاصة بنا وتوافق على جمع وتخزين واستخدام معلوماتك الشخصية كما هو موضح. أنت تقر بأن بياناتك قد يتم أرشفتها بعد انتهاء الالتزام لأغراض الامتثال أو للرجوع إليها في المستقبل، وتقبل شروط هذه العملية. إذا كنت ترغب في أي وقت في سحب موافقتك أو تعديل استخدام بياناتك، يمكنك ممارسة حقوقك كما هو موضح أعلاه.",
      "contactInfo": "إذا كانت لديك أي أسئلة أو مخاوف بشأن سياسة الخصوصية هذه، يرجى الاتصال بنا على connectedengaged@gmail.com.",
      "backToBase": "العودة إلى الأساس"
    }
  },
  "zh": {
    "login": {
      "title": "你已连接并参与吗？",
      "helpMessage": "在登录之前，请将图像旋转到正确的位置。请在登录前接受或拒绝cookie。",
      "loginButton": "登录",
      "noAccountText": "没有账号？",
      "registerLink": "在这里注册",
      "forgottenPasswordLink": "忘记密码？",
      "consent": {
        "customize": "自定义",
        "acceptAll": "全部接受",
        "rejectAll": "全部拒绝",
        "info": "信息"
      },
      "modalTitle": "Cookie信息",
      "closeButton": "关闭",
      "rejectAllMessage": "我们已删除所有cookie",
      "infoMessage": "我们有两个cookie，用于记住您的用户名和语言偏好，以避免下次登录时必须记住用户名或重新选择语言偏好的麻烦",
      "customizeMessage": "您可以接受应用程序特定的cookie或拒绝它们。",
      "passwordLengthError": "密码至少需要 8 个字符",
      "cookieConsentError": "请在登录前接受或拒绝 Cookie。",
      "imageOrientationError": "请在提交前正确调整图像的方向。",
      "loginSuccess": "登录成功",
      "loginFailed": "登录失败",
      "loginFailedNetwork": "由于网络错误，登录失败",
      "privacyPolicyLink": "隐私政策"
    },
    "privacyPolicy": {
      "title": "隐私政策",
      "introductionTitle": "介绍",
      "introductionText": "我们收集您的用户名、电子邮件地址、密码、个人资料图片、个人资料视频、性取向、爱好、偏好、性别、关于您自己和您理想的机器人伴侣的信息、位置信息（坐标）、首选语言、居住国家、注册IP地址和平台FeedScreen的互动历史。",
      "dataCollectionTitle": "我们收集的数据",
      "dataCollectionText": "我们收集您的用户名、电子邮件地址、密码、头像、个人视频、用户偏好数据*、\n 关于您和理想机器人伙伴的信息、位置信息（坐标）、首选语言、居住国家、注册IP地址以及平台FeedScreen的互动历史。",
      "dataCollectionText2": "*用户偏好数据：在注册过程中，我们会收集与您的偏好相关的数据，包括但不限于爱好、理想的伙伴特征和视觉选择。这些信息用于个性化您的平台体验，并可能用于匹配或推荐目的。",
      "howWeUseDataTitle": "我们如何使用您的数据",
      "howWeUseDataText": "我们使用您的数据来提供我们的服务并增强您在平台上的体验。这包括使用您的用户名和个人资料信息，允许您与其他用户互动，分享内容并参与FeedScreen的讨论。您的位置信息帮助我们提供本地化内容，而您的偏好和个人资料详细信息使我们能够根据您的兴趣和偏好定制推荐、匹配和互动。您的使用数据会被分析，以改进平台的功能，开发新功能，并确保顺畅和响应迅速的用户体验。此外，我们可能会使用您的电子邮件地址向您发送有关您帐户的重要通知和更新，以及相关平台信息。我们确保您的数据以符合隐私法规的方式安全处理。",
      "dataRetentionTitle": "数据保留",
      "dataRetentionText": "我们只在必要的时间内保留您的个人数据，以提供我们的服务并遵守法律义务。一旦互动结束，无论是由用户删除还是到期，所有相关的媒体和文本条目都会存储在一个压缩文件中以供归档。此归档数据由我们的服务提供商管理，并在需要时用于合规、故障排除或应用户请求访问。然而，如果没有这种需要，归档数据将在预定时间后被安全删除。",
      "rightsTitle": "您的权利",
      "rightsText": "您有权随时访问、修改或删除您的个人数据。这包括下载或请求存储在您的互动会话中的互动记录和媒体的副本。如果您选择删除您的数据，它将根据我们的数据保留政策从系统中删除。此外，您可以在计划删除之前请求删除归档数据。",
      "consentTitle": "同意",
      "consentText": "使用此应用程序即表示您同意我们的隐私政策，并同意按照说明收集、存储和使用您的个人信息。您确认您的数据在交互过期后可能会被归档以供合规或将来参考，您接受此过程的条款。如果您希望在任何时候撤回您的同意或更改数据的使用，您可以行使上述权利。",
      "contactInfo": "如果您对本隐私政策有任何疑问或担忧，请通过 connectedengaged@gmail.com 与我们联系。",
      "backToBase": "返回基地"
    }
  },
  "ga": {
    "login": {
      "title": "An bhfuil tú Ceangailte agus Rannpháirteach?",
      "helpMessage": "Rothlaigh na híomhánna chun iad a bheith dírithe i gceart sula logálann tú isteach. Glac nó diúltaigh fianáin sula logálann tú isteach.",
      "loginButton": "Logáil Isteach",
      "noAccountText": "Níl cuntas agat?",
      "registerLink": "Cláraigh anseo",
      "forgottenPasswordLink": "Pasfhocal dearmadta?",
      "consent": {
        "customize": "Saincheap",
        "acceptAll": "Glac le Gach Rud",
        "rejectAll": "Diúltaigh do Gach Rud",
        "info": "Eolas"
      },
      "modalTitle": "Eolas Fianáin",
      "closeButton": "Dún",
      "rejectAllMessage": "Tá gach fianán bainte againn",
      "infoMessage": "Tá dhá fhianán againn le haghaidh do ainm úsáideora agus do rogha teanga a mheabhrú, ionas nach mbeidh ort cuimhneamh ar do ainm úsáideora nó an rogha teanga a athrú an chéad uair eile a logálann tú isteach.",
      "customizeMessage": "Is féidir leat glacadh le fianáin sonracha don fheidhmchlár nó diúltú dóibh.",
      "passwordLengthError": "Caithfidh an pasfhocal a bheith ar a laghad 8 gcarachtar",
      "cookieConsentError": "Glac nó diúltaigh fianáin sula logálann tú isteach.",
      "imageOrientationError": "Déan cinnte go bhfuil na híomhánna dírithe i gceart sula gcuireann tú isteach iad.",
      "loginSuccess": "Logáil isteach rathúil",
      "loginFailed": "Theip ar logáil isteach",
      "loginFailedNetwork": "Theip ar logáil isteach de bharr earráid líonra",
      "privacyPolicyLink": "Polasaí Príobháideachais"
    },
    "privacyPolicy": {
      "title": "Beartas Príobháideachta",
      "introductionTitle": "Réamhrá",
      "introductionText": "Bailímid d’ainm úsáideora, seoladh ríomhphoist, pasfhocal, pictiúr próifíle, físeán próifíle, claonadh gnéasach, caitheamh aimsire, roghanna, inscne, faisnéis fút féin agus do chomrádaí róbait idéalach, sonraí suímh (comhordanáidí), teanga roghnaithe, tír chónaithe, seoladh IP cláraithe, agus stair idirghníomhaíochta ó FothaScáileán na hardáin.",
      "dataCollectionTitle": "Sonraí a Bhailímid",
      "dataCollectionText": "Bailímid d’ainm úsáideora, do sheoladh ríomhphoist, do phasfhocal, do phictiúr próifíle, do fhíseán próifíle, Sonraí Tosaíochta Úsáideora*, \n faisnéis fút féin agus faoin gcomhghleacaí róbó idéalach atá agat, sonraí suímh (comhordanáidí), teanga is fearr leat, tír chónaithe, seoladh IP cláraithe, agus stair idirghníomhaíochta ón FeedScreen ardáin.",
      "dataCollectionText2": "*Sonraí Tosaíochta Úsáideora: Le linn an phróisis Chláraithe, bailímid sonraí a bhaineann le do thosaíochtaí, lena n-áirítear ach gan a bheith teoranta do chaitheamh aimsire, tréithe comhlánaithe idéalacha, agus roghanna amhairc. Úsáidtear an fhaisnéis seo chun do thaithí ar an ardán a phearsantú agus d’fhéadfadh sé a bheith in úsáid le haghaidh meaitseála nó moltaí.",
      "howWeUseDataTitle": "Conas a Úsáidimid Do Shonraí",
      "howWeUseDataText": "Bainimid úsáid as do chuid sonraí chun ár seirbhísí a sholáthar agus chun do thaithí ar an ardán a fheabhsú. Áiríonn sé seo úsáid a bhaint as d’ainm úsáideora agus faisnéis do phróifíle chun ligean duit idirghníomhú le húsáideoirí eile, ábhar a roinnt, agus páirt a ghlacadh i bpléanna ar an FeedScreen. Cuidíonn do shonraí suímh linn ábhar áitiúil a sholáthar, agus cuidíonn do roghanna agus sonraí do phróifíle linn moltaí, cluichí agus idirghníomhaíochtaí a chur in oiriúint do do chuid suimeanna agus do thosaíochtaí. Déantar anailís ar do shonraí úsáide chun feidhmiúlacht na hardáin a fheabhsú, gnéithe nua a fhorbairt, agus taithí úsáideora réidh agus sofhreagrach a chinntiú. Ina theannta sin, féadfaimid do sheoladh ríomhphoist a úsáid chun fógraí tábhachtacha agus nuashonruithe maidir le do chuntas a sheoladh chugat, chomh maith le faisnéis ábhartha faoin ardán. Déanaimid cinnte go láimhseáiltear do chuid sonraí go slán agus de réir rialacháin phríobháideachta.",
      "dataRetentionTitle": "Coinneáil Sonraí",
      "dataRetentionText": "Coimeádaimid do shonraí pearsanta ach amháin ar feadh an ama atá riachtanach chun ár seirbhísí a sholáthar agus chun cloí le hoibleagáidí dlíthiúla. Nuair a thagann deireadh leis an gceangal, cibé acu trí scriosadh úsáideora nó trí dhul in éag, stóráiltear na meáin agus na hiontrálacha téacs gaolmhara i gcomhad zip chun críocha cartlannaithe. Déanann ár soláthraí seirbhíse na sonraí cartlainne seo a bhainistiú agus is féidir iad a rochtain más gá chun comhlíonadh, fabhtcheartú, nó ar iarratas an úsáideora. Mar sin féin, mura n-éiríonn le gá den sórt sin, scriosfar na sonraí cartlainne go sábháilte tar éis tréimhse réamhshocraithe.",
      "rightsTitle": "Do Chearta",
      "rightsText": "Tá sé de cheart agat rochtain a fháil ar do shonraí pearsanta, iad a mhodhnú nó a scriosadh ag am ar bith. Áiríonn sé seo an ceart chun cóipeanna de do chuid idirghníomhaíochtaí agus meáin atá stóráilte i do sheisiúin rannpháirtíochta a íoslódáil nó a iarraidh. Má roghnaíonn tú do chuid sonraí a scriosadh, bainfear iad ón gcóras de réir ár bpolasaí coinneála sonraí. Ina theannta sin, féadfaidh tú a iarraidh go mbainfear sonraí cartlainne roimh an scriosadh sceidealta.",
      "consentTitle": "Toiliú",
      "consentText": "Trí úsáid a bhaint as an aip seo, aontaíonn tú lenár bpolasaí príobháideachais agus glacann tú leis go mbailítear, stóráiltear agus úsáidtear do chuid faisnéise pearsanta mar a thuairiscítear. Aithníonn tú gur féidir do chuid sonraí a chartlannú tar éis don rannpháirtíocht dul in éag chun críocha comhlíonta nó le haghaidh tagartha amach anseo, agus glacann tú le téarmaí an phróisis seo. Más mian leat do thoiliú a tharraingt siar nó úsáid do shonraí a athrú ag aon am, is féidir leat do chearta a fheidhmiú mar a thuairiscítear thuas.",
      "contactInfo": "Má tá aon cheist nó imní ort maidir leis an mBeartas Príobháideachta seo, déan teagmháil linn le do thoil ag connectedengaged@gmail.com.",
      "backToBase": "Ar ais go bun"
    }
  }
}
